API/Tests/FlightReservation/Result7/Report/Data/Step2.xml

<?xml-stylesheet href="..//StServiceCallActivity.xsl" type="text/xsl"?><report><VTD_Type name="Type">HP.ST.Ext.WebServicesActivities.StServiceCallActivity</VTD_Type><VTD_Name name="Step ID">StServiceCallActivity4</VTD_Name><InputXml name="InputXml" xml="True" link="True" FileLocation="StServiceCallActivity4_InputXml_86ca9689-0030-4773-97a8-e2e3e9367ef4.xml">&lt;Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;Body&gt;
    &lt;GetFlights xmlns="HP.SOAQ.SampleApp"&gt;
      &lt;DepartureCity&gt;London&lt;/DepartureCity&gt;
      &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
      &lt;FlightDate&gt;2025-01-14T00:00:00+05:30&lt;/FlightDate&gt;
    &lt;/GetFlights&gt;
  &lt;/Body&gt;
&lt;/Envelope&gt;</InputXml><Service name="Service">Flights_Service</Service><Port name="Port">FlightsServiceMethods</Port><Operation name="Operation">GetFlights</Operation><Address name="Address">http://localhost:8000/Flights_SOAP</Address><SOAPAction name="SOAPAction">HP.SOAQ.SampleApp/IFlightsSoapService/GetFlights</SOAPAction><ContentType name="ContentType">text/xml; charset=utf-8</ContentType><MessageExchangePattern name="MessageExchangePattern">Request Response</MessageExchangePattern><Full_request name="Full request" TooLong="True" link="True" FileLocation="StServiceCallActivity4_Full_request_e828836e-542c-4ada-964a-308ae17b7dd4.xml">&lt;?xml version="1.0"? ... &lt;/Body&gt;
&lt;/Envelope&gt;</Full_request><InputHeader name="InputHeader">SOAPAction:	HP.SOAQ.SampleApp/IFlightsSoapService/GetFlights
Content-Type:	text/xml; charset=utf-8
Host:	localhost:8000
Content-Length:	260
Connection:	Close
</InputHeader><OutputHeader name="OutputHeader">Connection:	close
Content-Length:	2659
Content-Type:	text/xml; charset=utf-8
Date:	Mon, 06 Jan 2025 11:27:01 GMT
Server:	Microsoft-HTTPAPI/2.0
</OutputHeader><OutputText name="OutputText">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;&lt;s:Body&gt;&lt;GetFlightsResponse xmlns="HP.SOAQ.SampleApp"&gt;&lt;GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;08:53 AM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;London&lt;/DepartureCity&gt;&lt;DepartureTime&gt;08:09 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;17979&lt;/FlightNumber&gt;&lt;Price&gt;179.47&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AF&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;10:00 AM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;London&lt;/DepartureCity&gt;&lt;DepartureTime&gt;08:00 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;19072&lt;/FlightNumber&gt;&lt;Price&gt;161.9&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;08:45 AM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;London&lt;/DepartureCity&gt;&lt;DepartureTime&gt;08:00 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;19074&lt;/FlightNumber&gt;&lt;Price&gt;105.4&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AF&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;11:30 AM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;London&lt;/DepartureCity&gt;&lt;DepartureTime&gt;08:00 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;19075&lt;/FlightNumber&gt;&lt;Price&gt;173.47&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;11:09 AM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;London&lt;/DepartureCity&gt;&lt;DepartureTime&gt;10:24 AM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;19078&lt;/FlightNumber&gt;&lt;Price&gt;104&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;01:33 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;London&lt;/DepartureCity&gt;&lt;DepartureTime&gt;12:48 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;19082&lt;/FlightNumber&gt;&lt;Price&gt;106&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;DL&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;04:42 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;London&lt;/DepartureCity&gt;&lt;DepartureTime&gt;03:12 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;19085&lt;/FlightNumber&gt;&lt;Price&gt;178.47&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;03:57 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;London&lt;/DepartureCity&gt;&lt;DepartureTime&gt;03:12 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;19086&lt;/FlightNumber&gt;&lt;Price&gt;105.3&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;06:29 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;London&lt;/DepartureCity&gt;&lt;DepartureTime&gt;05:45 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;19395&lt;/FlightNumber&gt;&lt;Price&gt;110.8&lt;/Price&gt;&lt;/Flight&gt;&lt;Flight&gt;&lt;Airline&gt;AA&lt;/Airline&gt;&lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;&lt;ArrivalTime&gt;01:41 PM&lt;/ArrivalTime&gt;&lt;DepartureCity&gt;London&lt;/DepartureCity&gt;&lt;DepartureTime&gt;12:57 PM&lt;/DepartureTime&gt;&lt;FlightNumber&gt;19689&lt;/FlightNumber&gt;&lt;Price&gt;120.4&lt;/Price&gt;&lt;/Flight&gt;&lt;/GetFlightsResult&gt;&lt;/GetFlightsResponse&gt;&lt;/s:Body&gt;&lt;/s:Envelope&gt;</OutputText><HttpStatusCode name="HttpStatusCode">200 : OK</HttpStatusCode><OutputXml name="OutputXml" xml="True" link="True" FileLocation="StServiceCallActivity4_OutputXml_6da092c4-634f-4646-9e25-ffd2aa4937e6.xml">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s:Body&gt;
    &lt;GetFlightsResponse xmlns="HP.SOAQ.SampleApp"&gt;
      &lt;GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;AA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;08:53 AM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;London&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;08:09 AM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;17979&lt;/FlightNumber&gt;
          &lt;Price&gt;179.47&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;AF&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;10:00 AM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;London&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;08:00 AM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;19072&lt;/FlightNumber&gt;
          &lt;Price&gt;161.9&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;AA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;08:45 AM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;London&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;08:00 AM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;19074&lt;/FlightNumber&gt;
          &lt;Price&gt;105.4&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;AF&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;11:30 AM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;London&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;08:00 AM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;19075&lt;/FlightNumber&gt;
          &lt;Price&gt;173.47&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;AA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;11:09 AM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;London&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;10:24 AM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;19078&lt;/FlightNumber&gt;
          &lt;Price&gt;104&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;AA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;01:33 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;London&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;12:48 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;19082&lt;/FlightNumber&gt;
          &lt;Price&gt;106&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;DL&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;04:42 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;London&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;03:12 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;19085&lt;/FlightNumber&gt;
          &lt;Price&gt;178.47&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;AA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;03:57 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;London&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;03:12 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;19086&lt;/FlightNumber&gt;
          &lt;Price&gt;105.3&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;AA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;06:29 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;London&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;05:45 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;19395&lt;/FlightNumber&gt;
          &lt;Price&gt;110.8&lt;/Price&gt;
        &lt;/Flight&gt;
        &lt;Flight&gt;
          &lt;Airline&gt;AA&lt;/Airline&gt;
          &lt;ArrivalCity&gt;Los Angeles&lt;/ArrivalCity&gt;
          &lt;ArrivalTime&gt;01:41 PM&lt;/ArrivalTime&gt;
          &lt;DepartureCity&gt;London&lt;/DepartureCity&gt;
          &lt;DepartureTime&gt;12:57 PM&lt;/DepartureTime&gt;
          &lt;FlightNumber&gt;19689&lt;/FlightNumber&gt;
          &lt;Price&gt;120.4&lt;/Price&gt;
        &lt;/Flight&gt;
      &lt;/GetFlightsResult&gt;
    &lt;/GetFlightsResponse&gt;
  &lt;/s:Body&gt;
&lt;/s:Envelope&gt;</OutputXml><VTD_Message name="Message">Web service call performed successfully</VTD_Message><Name name="Name">'GetFlights'</Name><Comment name="Comment">''</Comment><VTD_Status name="Status">Done</VTD_Status></report>